[
    {
      "id": "1180000001",
      "text": "The primary goal of the CPA in performing the attest function is to",
      "choices": [
        {
          "id": "c1",
          "text": "Detect fraud"
        },
        {
          "id": "c2",
          "text": "Examine individual transactions so that the auditor may certify as to their validity"
        },
        {
          "id": "c3",
          "text": "Determine whether the clients assertions are fairly stated"
        },
        {
          "id": "c4",
          "text": "Assure the consistent application of correct accounting procedures"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The main objective of attestation is to evaluate and report on the reliability of management's assertions."
    },
    {
      "id": "1180000002",
      "text": "An attestation engagement",
      "choices": [
        {
          "id": "c1",
          "text": "Has as its primary source of standards the assurance standards"
        },
        {
          "id": "c2",
          "text": "Includes a report on subject matter, or on an assertion about subject matter"
        },
        {
          "id": "c3",
          "text": "Includes search and verification procedures for all major accounts"
        },
        {
          "id": "c4",
          "text": "Is ordinarily an examination, review or compilation engagement"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Attestation engagements result in a report on the subject matter or assertions about the subject matter."
    },
    {
      "id": "1180000003",
      "text": "Which of the following statements best describes assurance services?",
      "choices": [
        {
          "id": "c1",
          "text": "Independent professional services that are intended to enhance the credibility of information to meet the needs of an intended user"
        },
        {
          "id": "c2",
          "text": "Services designed to express an opinion on the fairness of historical financial statements based on the results of an audit"
        },
        {
          "id": "c3",
          "text": "The preparation of financial statements or the collection, classification and summarization of other financial information"
        },
        {
          "id": "c4",
          "text": "Services designed for the improvement of operations, resulting in better outcomes"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Assurance services are designed to improve the quality of information for decision makers."
    },
    {
      "id": "1180000004",
      "text": "The primary reason for a financial statement audit by an external audit firm is",
      "choices": [
        {
          "id": "c1",
          "text": "To satisfy governmental regulatory requirements"
        },
        {
          "id": "c2",
          "text": "To guarantee that there are no misstatements in the financial statements"
        },
        {
          "id": "c3",
          "text": "To provide increased assurance to users as to the fairness of the financial statements"
        },
        {
          "id": "c4",
          "text": "To ensure that any fraud will be discovered"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The main purpose of an audit is to provide reasonable assurance about the fairness of financial statements."
    },
    {
      "id": "1180000005",
      "text": "An audit of the financial statements is being conducted by an external auditor. The external auditor is expected to",
      "choices": [
        {
          "id": "c1",
          "text": "Express an opinion as to the fairness of the financial statements"
        },
        {
          "id": "c2",
          "text": "Express an opinion as to the fairness for investment purposes"
        },
        {
          "id": "c3",
          "text": "Certify the correctness of the financial statements"
        },
        {
          "id": "c4",
          "text": "Examine all evidence supporting the financial statements"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The auditor's primary responsibility is to express an opinion on the fairness of the financial statements."
    },
    {
      "id": "1180000006",
      "text": "A financial statement audit aids in the communication of economic data because the audit",
      "choices": [
        {
          "id": "c1",
          "text": "Assures the readers of financial statements that any fraudulent activity has been corrected"
        },
        {
          "id": "c2",
          "text": "Guarantees that financial data are fairly presented"
        },
        {
          "id": "c3",
          "text": "Lends credibility to the financial statements"
        },
        {
          "id": "c4",
          "text": "Confirms the accuracy of managements financial representations"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "An audit enhances the reliability of financial statements by providing independent verification."
    },
    {
      "id": "1180000007",
      "text": "Which of the following best describes the reason why an independent auditor reports on financial statements?",
      "choices": [
        {
          "id": "c1",
          "text": "A management fraud may exist, and it is more likely to be detected by independent auditors"
        },
        {
          "id": "c2",
          "text": "Different interests may exist between the company preparing the statements and the persons using the statements"
        },
        {
          "id": "c3",
          "text": "A misstatement of account balances may exist and is generally corrected as the result of the independent auditors work"
        },
        {
          "id": "c4",
          "text": "A poorly designed internal control system may be in existence"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "The auditor's independence helps bridge the potential conflict of interest between preparers and users of financial statements."
    },
    {
      "id": "1180000008",
      "text": "An audit of financial statements is conducted to determine if the",
      "choices": [
        {
          "id": "c1",
          "text": "Organization is operating efficiently and effectively"
        },
        {
          "id": "c2",
          "text": "Auditee is following specific procedures or rules set down by some higher authority"
        },
        {
          "id": "c3",
          "text": "Overall financial statements are stated in accordance with the applicable financial reporting framework"
        },
        {
          "id": "c4",
          "text": "Clients internal control is functioning as intended"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The primary purpose of a financial statement audit is to verify compliance with the applicable reporting framework."
    },
    {
      "id": "1180000009",
      "text": "Which of the following best describes what is meant by generally accepted auditing standards?",
      "choices": [
        {
          "id": "c1",
          "text": "Acts to be performed by the auditors"
        },
        {
          "id": "c2",
          "text": "Measures of the quality of the auditors performance"
        },
        {
          "id": "c3",
          "text": "Procedures to be used to gather evidence to support financial statements"
        },
        {
          "id": "c4",
          "text": "Audit objectives generally determined on audit engagements"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "GAAS are standards that measure the quality of the auditor's performance."
    },
    {
      "id": "1180000010",
      "text": "The review of a companys financial statements by a CPA firm",
      "choices": [
        {
          "id": "c1",
          "text": "Is substantially less in scope of procedures than an audit"
        },
        {
          "id": "c2",
          "text": "Requires detailed analysis of the major accounts"
        },
        {
          "id": "c3",
          "text": "Is of similar scope as an audit and adds similar credibility to the statements."
        },
        {
          "id": "c4",
          "text": "Culminates in issuance of a report expressing the CPAs opinion as to the fairness of the statements."
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "A review engagement involves fewer procedures than an audit and provides limited assurance."
    },
    {
      "id": "1180000011",
      "text": "Which of the following describes how the objective of a review of financial statements differs from the objective of a compilation engagement?",
      "choices": [
        {
          "id": "c1",
          "text": "The primary objective of a review engagement is to test the completeness of the financial statements prepared, but a compilation tests for reasonableness"
        },
        {
          "id": "c2",
          "text": "The primary objective of a review engagement is to provide positive assurance that the financial statements are fairly presented, but a compilation provides no such assurance"
        },
        {
          "id": "c3",
          "text": "In a review engagement, accountants provide limited assurance, but a compilation expresses no assurance"
        },
        {
          "id": "c4",
          "text": "In a review engagement, accountants provide reasonable or positive assurance that the financial statements are fairly presented, but a compilation provides limited assurance"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "A review provides limited assurance while a compilation provides no assurance."
    },
    {
      "id": "1180000012",
      "text": "In an engagement to perform agreed-upon procedures, an auditor is engaged to",
      "choices": [
        {
          "id": "c1",
          "text": "Carry out those procedures of an audit nature to which the auditor and the entity and any appropriate third parties have agreed to report on factual findings"
        },
        {
          "id": "c2",
          "text": "Use accounting expertise as opposed to auditing expertise to collect, classify and summarize financial information"
        },
        {
          "id": "c3",
          "text": "Provide a moderate level of assurance that the information is free of material misstatement"
        },
        {
          "id": "c4",
          "text": "Provide a high, but not absolute, level of assurance that the information is free of material misstatement"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Agreed-upon procedures engagements involve performing specific procedures and reporting factual findings."
    },
    {
      "id": "1180000013",
      "text": "An accountant may accept an engagement to apply agreed-upon procedures to prospective financial statements provided that",
      "choices": [
        {
          "id": "c1",
          "text": "Use of the report is restricted to the specified parties"
        },
        {
          "id": "c2",
          "text": "The prospective financial statements are also examined and audited"
        },
        {
          "id": "c3",
          "text": "Responsibility for the adequacy of the procedures performed is taken by the accountant"
        },
        {
          "id": "c4",
          "text": "Negative assurance is expressed on the prospective financial statements taken as a whole"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Agreed-upon procedures reports are typically restricted to specified parties who understand the procedures performed."
    },
    {
      "id": "1180000014",
      "text": "Mr. Accounting, CPA, was engaged by a group of royalty recipients to apply agreed-upon procedures to financial data supplied by X Co. regarding Xs written assertion about its compliance with contractual requirements to pay royalties. Mr. Accountings report on these agreed-upon procedures should contain a an",
      "choices": [
        {
          "id": "c1",
          "text": "Disclaimer of opinion about the fair presentation of Xs financial statements"
        },
        {
          "id": "c2",
          "text": "List of the procedures performed or reference thereto and Mr. Accountings findings"
        },
        {
          "id": "c3",
          "text": "Opinion about the effectiveness of Xs internal control activities concerning royalty payments"
        },
        {
          "id": "c4",
          "text": "Acknowledgment that the sufficiency of the procedures is solely Mr. Accountings responsibility"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Agreed-upon procedures reports should include the procedures performed and the findings."
    },
    {
      "id": "1180000015",
      "text": "When compiling the financial statements of a client, an accountant should",
      "choices": [
        {
          "id": "c1",
          "text": "Review agreements with financial institutions for restrictions on cash balances"
        },
        {
          "id": "c2",
          "text": "Understand the accounting principles and practices of the entitys industry"
        },
        {
          "id": "c3",
          "text": "Inquire of key personnel concerning related parties and subsequent events"
        },
        {
          "id": "c4",
          "text": "Perform ratio analyses of the financial data of comparable prior periods"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Understanding industry practices is essential for proper compilation of financial statements."
    },
    {
      "id": "1180000016",
      "text": "When performing a compilation engagement, the accountant is required to",
      "choices": [
        {
          "id": "c1",
          "text": "Assess internal controls"
        },
        {
          "id": "c2",
          "text": "Make inquiries of management to assess the reliability and completeness of the information provided"
        },
        {
          "id": "c3",
          "text": "Verify matters and explanations"
        },
        {
          "id": "c4",
          "text": "Obtain a general knowledge of the business and operations of the entity"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "A compilation engagement requires understanding the entity's business and operations."
    },
    {
      "id": "1180000017",
      "text": "Which of the following statements concerning compilation engagement is incorrect?",
      "choices": [
        {
          "id": "c1",
          "text": "In a compilation engagement, the accountant is engaged to use accounting expertise as opposed to auditing expertise to collect, classify and summarize financial information"
        },
        {
          "id": "c2",
          "text": "The procedures employed in a compilation engagement enable the accountant to express a moderate level of assurance on the compiled financial information"
        },
        {
          "id": "c3",
          "text": "Users of the compiled financial information derive some benefit as a result of the accountants involvement because the service has been performed with due professional skill and care"
        },
        {
          "id": "c4",
          "text": "A compilation engagement ordinarily entails reducing detailed data to a manageable and understandable form without a requirement to test the assertions underlying that information"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Compilation engagements provide no assurance, only presentation of financial information."
    },
    {
      "id": "1180000018",
      "text": "Which of the following procedures is ordinarily performed by an accountant in a compilation engagement?",
      "choices": [
        {
          "id": "c1",
          "text": "Reading the financial statements to consider whether they are free of obvious mistakes in the application of accounting principles"
        },
        {
          "id": "c2",
          "text": "Obtaining written representations from management indicating that the compiled financial statements will not be used to obtain credit"
        },
        {
          "id": "c3",
          "text": "Making inquiries of management concerning actions taken at meetings of the stockholders and the board of directors"
        },
        {
          "id": "c4",
          "text": "Applying analytical procedures designed to corroborate managements assertions that are embodied in the financial statement components"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Basic reading and review for obvious errors is a standard compilation procedure."
    },
    {
      "id": "1180000019",
      "text": "Which of the following statements concerning consulting services is false?",
      "choices": [
        {
          "id": "c1",
          "text": "The performance of consulting services for audit clients does not, in and of itself, impair the auditors independence"
        },
        {
          "id": "c2",
          "text": "Consulting services differ fundamentally from the CPAs function of attesting to the assertions of other parties"
        },
        {
          "id": "c3",
          "text": "Consulting services ordinarily involves external reporting"
        },
        {
          "id": "c4",
          "text": "Most CPAs, including those who provide audit and tax services, also provide consulting services to their clients"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Consulting services typically involve internal reporting and recommendations rather than external reporting."
    },
    {
      "id": "1180000020",
      "text": "Which of the following is one of the limitations of an audit?",
      "choices": [
        {
          "id": "c1",
          "text": "The possibility that management may prevent the auditor from performing the necessary audit procedures"
        },
        {
          "id": "c2",
          "text": "The likelihood that the auditor may not be able to detect material misstatements in the financial statements because the auditor is engaged only after the clients year-end"
        },
        {
          "id": "c3",
          "text": "The fact that most audit evidence is persuasive rather than conclusive in nature"
        },
        {
          "id": "c4",
          "text": "The risk that the auditor may not possess the training and proficiency required by the engagement"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Audit evidence is typically persuasive rather than conclusive, which is a fundamental limitation of auditing."
    },
    {
      "id": "1180000021",
      "text": "Operational auditing is primarily oriented toward",
      "choices": [
        {
          "id": "c1",
          "text": "Future operational improvements to accomplish the goals of management"
        },
        {
          "id": "c2",
          "text": "The accuracy of data reflected in managements financial records"
        },
        {
          "id": "c3",
          "text": "The verification that a companys financial statements are fairly presented"
        },
        {
          "id": "c4",
          "text": "Past protection provided by existing internal control"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Operational auditing focuses on improving future operations and achieving management's goals."
    },
    {
      "id": "1180000022",
      "text": "A typical objective of an operational audit is for the auditor to",
      "choices": [
        {
          "id": "c1",
          "text": "Determine whether the financial statements fairly present the entitys operations"
        },
        {
          "id": "c2",
          "text": "Evaluate the feasibility of attaining the entitys operational objectives"
        },
        {
          "id": "c3",
          "text": "Make recommendations for improving performance"
        },
        {
          "id": "c4",
          "text": "Report on the entitys relative success in attaining profit maximization"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Operational audits aim to identify areas for improvement and make recommendations."
    },
    {
      "id": "1180000023",
      "text": "Which of the following statements best describes why the CPA profession has deemed it essential to promulgate ethical standards and to establish means for ensuring their observance?",
      "choices": [
        {
          "id": "c1",
          "text": "A requirement for a profession is the establishment of ethical standards that stress primarily a responsibility to clients and colleagues"
        },
        {
          "id": "c2",
          "text": "A requirement of most state laws calls for the profession to establish a code of ethics"
        },
        {
          "id": "c3",
          "text": "An essential means of self-protection for the profession is the establishment of flexible ethical standards by the profession"
        },
        {
          "id": "c4",
          "text": "A distinguishing mark of a profession is its acceptance of responsibility to the public"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The CPA profession recognizes the importance of ethical standards to ensure the integrity and credibility of the profession."
    },
    {
      "id": "1180000024",
      "text": "A basic objective of a CPA firm is to provide professional services that conform with professional standards. Reasonable assurance of achieving this basic objective is provided through",
      "choices": [
        {
          "id": "c1",
          "text": "A system of peer review"
        },
        {
          "id": "c2",
          "text": "Continuing professional education"
        },
        {
          "id": "c3",
          "text": "A system of quality control"
        },
        {
          "id": "c4",
          "text": "Compliance with generally accepted reporting standards"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Quality control is essential for providing reasonable assurance of professional standards."
    },
    {
      "id": "1180000025",
      "text": "The objective of quality control mandates that a public accounting firm should establish policies and procedures for professional development which provide reasonable assurance that all entry-level personnel",
      "choices": [
        {
          "id": "c1",
          "text": "Prepare working papers which are standardized in form and content"
        },
        {
          "id": "c2",
          "text": "Have the knowledge required to enable them to fulfill responsibilities assigned"
        },
        {
          "id": "c3",
          "text": "Will advance within the organization"
        },
        {
          "id": "c4",
          "text": "Develop specialties in specific areas of accounting"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Entry-level personnel need to have the necessary knowledge to perform their duties effectively."
    },
    {
      "id": "1180000026",
      "text": "The Philippine Standards on Quality Control PSQCs are to be applied to",
      "choices": [
        {
          "id": "c1",
          "text": "Assurance engagements only"
        },
        {
          "id": "c2",
          "text": "Review Assurance engagements only"
        },
        {
          "id": "c3",
          "text": "Compilation and review engagements only"
        },
        {
          "id": "c4",
          "text": "All services that fall under the AASCs engagement standards"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "PSQCs are applicable to all services provided under the AASCs engagement standards."
    },
    {
      "id": "1180000027",
      "text": "For audits of financial statements of listed entities, the partner should",
      "choices": [
        {
          "id": "c1",
          "text": "Determine that an engagement quality control reviewer has been appointed"
        },
        {
          "id": "c2",
          "text": "Discuss significant matters arising during the audit engagement, including those identified during the engagement quality control review, with the engagement quality control reviewer"
        },
        {
          "id": "c3",
          "text": "Not issue the auditors report until the completion of the engagement quality control review"
        },
        {
          "id": "c4",
          "text": "All of the above"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The engagement partner should be responsible for the overall quality of the audit engagement."
    },
    {
      "id": "1180000028",
      "text": "The primary purpose of establishing quality control policies and procedures for deciding whether to accept a new client is to",
      "choices": [
        {
          "id": "c1",
          "text": "Enable the CPA firm to attest to the reliability of the client"
        },
        {
          "id": "c2",
          "text": "Satisfy the CPA firms duty to the public concerning the acceptance of new clients"
        },
        {
          "id": "c3",
          "text": "Minimize the likelihood of association with clients whose management lacks integrity"
        },
        {
          "id": "c4",
          "text": "Anticipate before performing any fieldwork whether an unqualified opinion can be expressed"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "The CPA firm has a responsibility to the public to ensure that clients are reliable."
    },
    {
      "id": "1180000029",
      "text": "The firm should establish policies and procedures designed to promote an internal culture based on the recognition that quality is essential in performing engagements. Such policies and procedures should require the firms chief executive officer or, if appropriate, the firms managing board of partners, to assume ultimate responsibility for the firms system of quality control",
      "choices": [
        {
          "id": "c1",
          "text": "Ethical requirements"
        },
        {
          "id": "c2",
          "text": "Monitoring"
        },
        {
          "id": "c3",
          "text": "Human resources"
        },
        {
          "id": "c4",
          "text": "Leadership responsibilities for quality within the firm"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The leadership of the firm is responsible for ensuring quality control policies and procedures are implemented."
    },
    {
      "id": "1180000030",
      "text": "Which of the following quality control policies and procedures does not relate to human resources and assignment?",
      "choices": [
        {
          "id": "c1",
          "text": "Emphasize independence of mental attitude in training programs and in supervision and review of the audits"
        },
        {
          "id": "c2",
          "text": "Monitor the effectiveness of recruiting programs"
        },
        {
          "id": "c3",
          "text": "Identify criteria which will be considered in evaluating individual performance and expected proficiency"
        },
        {
          "id": "c4",
          "text": "Identify on a timely basis the staffing requirements of specific audits"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Staffing requirements should be identified and addressed in a timely manner."
    },
    {
      "id": "1180000031",
      "text": "In connection with the element of assignment, a CPA firms system of quality control should ordinarily establish procedures that",
      "choices": [
        {
          "id": "c1",
          "text": "Provide adequate supervision at all levels, considering the training, ability and experience of the personnel assigned"
        },
        {
          "id": "c2",
          "text": "Encourage personnel to use authoritative sources on complex or unusual matter"
        },
        {
          "id": "c3",
          "text": "Require preparation of time budgets for audits to determine manpower requirements and to schedule the audit work"
        },
        {
          "id": "c4",
          "text": "Establish qualifications deemed necessary for various levels of responsibility within the firm"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Adequate supervision is essential for ensuring that personnel are qualified and competent."
    },
    {
      "id": "1180000032",
      "text": "In connection with the element of engagement performance, a CPA firms quality control should ordinarily provide that all personnel",
      "choices": [
        {
          "id": "c1",
          "text": "Have the knowledge required to enable them to fulfill responsibilities assigned"
        },
        {
          "id": "c2",
          "text": "Review and test compliance with the firms quality control policies and procedures"
        },
        {
          "id": "c3",
          "text": "Seek assistance from persons having appropriate levels of knowledge, judgment and authority"
        },
        {
          "id": "c4",
          "text": "Appropriately maintain independence when providing assurance services"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Compliance with quality control policies and procedures is essential for providing reasonable assurance."
    },
    {
      "id": "1180000033",
      "text": "An auditor who, before the completion of the engagement, is requested to change the engagement to one which provides a lower level of assurance, should",
      "choices": [
        {
          "id": "c1",
          "text": "Withdraw and consider whether there is any obligation to report to other parties the circumstances necessitating the withdrawal"
        },
        {
          "id": "c2",
          "text": "Issue a report that includes reference to the original engagement and any procedures that may have been performed in the original engagement"
        },
        {
          "id": "c3",
          "text": "Not agree to a change of engagement where there is no reasonable justification for doing so"
        },
        {
          "id": "c4",
          "text": "Consider the change reasonable if it relates to information that is correct, incomplete or otherwise unsatisfactory"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The auditor should withdraw and consider whether there is any obligation to report to other parties the circumstances necessitating the withdrawal."
    },
    {
      "id": "1180000034",
      "text": "As a guidance for measuring the quality of the performance of an auditor, the auditor should refer to",
      "choices": [
        {
          "id": "c1",
          "text": "Statements of the Financial Accounting Standards Board"
        },
        {
          "id": "c2",
          "text": "Generally Accepted Auditing Standards"
        },
        {
          "id": "c3",
          "text": "Interpretations of the Statements on Auditing Standards"
        },
        {
          "id": "c4",
          "text": "Statements on Quality Control Standards"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "GAAS provide a framework for measuring the quality of auditor performance."
    },
    {
      "id": "1180000035",
      "text": "A CPA, while performing an audit, strives to achieve independence in appearance in order to",
      "choices": [
        {
          "id": "c1",
          "text": "Reduce risk and liability"
        },
        {
          "id": "c2",
          "text": "Comply with the generally accepted standards of field work"
        },
        {
          "id": "c3",
          "text": "Become independent in fact"
        },
        {
          "id": "c4",
          "text": "Maintain public confidence in the profession"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Independence in appearance is crucial for maintaining public confidence in the profession."
    },
    {
      "id": "1180000036",
      "text": "Which of the following best describes a portion of the auditors responsibility regarding illegal acts by clients?",
      "choices": [
        {
          "id": "c1",
          "text": "The auditors have a responsibility to discover all material illegal acts"
        },
        {
          "id": "c2",
          "text": "If audit procedures reveal illegal acts, the auditors should take appropriate actions"
        },
        {
          "id": "c3",
          "text": "If the auditors suspect illegal acts have been performed, they should conduct a legal audit of the company"
        },
        {
          "id": "c4",
          "text": "The auditors responsibility for the detection of all illegal acts is the same as their responsibility regarding material misstatements due to errors and fraud"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "The auditor should take appropriate actions when illegal acts are discovered during an audit."
    },
    {
      "id": "1180000037",
      "text": "The auditors who find that the client has committed an illegal act would be most likely to withdraw from the engagement when the",
      "choices": [
        {
          "id": "c1",
          "text": "Management fails to take appropriate corrective action"
        },
        {
          "id": "c2",
          "text": "Illegal act has material financial statement implications"
        },
        {
          "id": "c3",
          "text": "Illegal act has received widespread publicity"
        },
        {
          "id": "c4",
          "text": "Auditors cannot reasonably estimate the effect of the illegal act on the financial statements"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "The auditor should withdraw from the engagement if the illegal act has material financial statement implications."
    },
    {
      "id": "1180000038",
      "text": "If an illegal act is discovered during the audit of a publicly held company, the auditors should first",
      "choices": [
        {
          "id": "c1",
          "text": "Notify the regulatory authorities"
        },
        {
          "id": "c2",
          "text": "Determine who was responsible for the illegal act"
        },
        {
          "id": "c3",
          "text": "Intensify the examination to identify all illegal acts"
        },
        {
          "id": "c4",
          "text": "Report the act to high level personnel within the clients organization and to the audit committee"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The auditor should notify the regulatory authorities about the illegal act as soon as possible."
    },
    {
      "id": "1180000039",
      "text": "The following are examples of error, except",
      "choices": [
        {
          "id": "c1",
          "text": "A mistake in gathering or processing data from which financial statements are prepared"
        },
        {
          "id": "c2",
          "text": "An incorrect accounting estimate arising from oversight or misinterpretation of facts"
        },
        {
          "id": "c3",
          "text": "A mistake in the application of accounting principles relating to measurement, recognition, classification, presentation, or disclosure"
        },
        {
          "id": "c4",
          "text": "Misrepresentation in the financial statements of events, transactions or other significant information"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Misrepresentation in the financial statements is not an error but a fraudulent act."
    },
    {
      "id": "1180000040",
      "text": "The term fraud refers to an intentional act by one or more individuals among management, those charged with governance, employees, or third parties, involving the use of deception to obtain an unjust or illegal advantage. Which statement is correct regarding fraud?",
      "choices": [
        {
          "id": "c1",
          "text": "Auditors make legal determinations of whether fraud has actually occurred"
        },
        {
          "id": "c2",
          "text": "Misstatement of the financial statements may not be the objective of some frauds"
        },
        {
          "id": "c3",
          "text": "Fraud involving one or more members of management or those charged with governance is referred to as employee fraud"
        },
        {
          "id": "c4",
          "text": "Fraud involving only employees of the entity is referred to as management fraud"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Misstatement of the financial statements may not be the objective of some frauds."
    },
    {
      "id": "1180000041",
      "text": "Fraudulent financial reporting involves intentional misstatements or omissions of amounts or disclosures in financial statements to deceive financial statement users. Fraudulent financial reporting least likely involve",
      "choices": [
        {
          "id": "c1",
          "text": "Deception such as manipulation, falsification, or alteration of accounting records or supporting documents from which the financial statements are prepared"
        },
        {
          "id": "c2",
          "text": "Misrepresentation in, or intentional omission from, the financial statements of events, transactions or other significant information"
        },
        {
          "id": "c3",
          "text": "Intentional misapplication of accounting principles relating to measurement, recognition, classification, presentation, or disclosure"
        },
        {
          "id": "c4",
          "text": "Embezzling receipts, stealing physical or intangible assets, or causing an entity to pay for goods and services not received"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Embezzling receipts, stealing physical or intangible assets, or causing an entity to pay for goods and services not received is least likely to be the objective of fraudulent financial reporting."
    },
    {
      "id": "1180000042",
      "text": "The risk of not detecting a material misstatement resulting from fraud is higher than the risk of not detecting a material misstatement resulting from error because",
      "choices": [
        {
          "id": "c1",
          "text": "The effect of fraudulent act is likely omitted in the accounting records"
        },
        {
          "id": "c2",
          "text": "Fraud is ordinarily accompanied by acts specifically designed to conceal its existence"
        },
        {
          "id": "c3",
          "text": "Fraud is always a result of connivance between or among employees"
        },
        {
          "id": "c4",
          "text": "The auditor is responsible to detect errors but not fraud"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Fraud is often accompanied by acts specifically designed to conceal its existence, making it more difficult to detect."
    },
    {
      "id": "1180000043",
      "text": "Which of the following best describes what is meant by the term fraud risk factor?",
      "choices": [
        {
          "id": "c1",
          "text": "Factors whose presence indicates that the risk of fraud is high"
        },
        {
          "id": "c2",
          "text": "Factors whose presence often has been observed in circumstances where frauds have occurred"
        },
        {
          "id": "c3",
          "text": "Factors whose presence requires modifications of planned audit procedures"
        },
        {
          "id": "c4",
          "text": "Reportable conditions identified during an audit"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Fraud risk factors are factors that often have been observed in circumstances where frauds have occurred."
    },
    {
      "id": "1180000044",
      "text": "Fraud risk factors relating to managements characteristics and influence over the control environment",
      "choices": [
        {
          "id": "c1",
          "text": "Pertain to managements abilities, pressures, style, and attitude relating to internal control and the financial reporting process"
        },
        {
          "id": "c2",
          "text": "Involve the economic and regulatory environment in which the entity operates"
        },
        {
          "id": "c3",
          "text": "Pertain to the nature and complexity of the entity and its transactions, the entitys financial condition, and its profitability"
        },
        {
          "id": "c4",
          "text": "Involve the lack of controls designed to prevent or detect misappropriation of assets"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Fraud risk factors relating to managements characteristics and influence over the control environment pertain to managements abilities, pressures, style, and attitude relating to internal control and the financial reporting process."
    },
    {
      "id": "1180000045",
      "text": "Which of the following is least likely a category of fraud risk factors that relate to misstatements resulting from fraudulent financial reporting?",
      "choices": [
        {
          "id": "c1",
          "text": "Managements characteristics and influence over the control environment"
        },
        {
          "id": "c2",
          "text": "Industry conditions"
        },
        {
          "id": "c3",
          "text": "Operating characteristics and financial stability"
        },
        {
          "id": "c4",
          "text": "Susceptibility of assets to misappropriation"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Susceptibility of assets to misappropriation is least likely to be a category of fraud risk factors that relate to misstatements resulting from fraudulent financial reporting."
    },
    {
      "id": "1180000046",
      "text": "Which of the following circumstances most likely indicate the possibility of fraud or error?",
      "choices": [
        {
          "id": "c1",
          "text": "Management engages in frank communication with appropriate third parties, such as regulators and bankers"
        },
        {
          "id": "c2",
          "text": "Evidence of an unduly lavish lifestyle by officers or employees"
        },
        {
          "id": "c3",
          "text": "Conservative application of accounting principles"
        },
        {
          "id": "c4",
          "text": "Minimal differences from expectations disclosed by analytical procedures"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Management's frank communication with appropriate third parties, such as regulators and bankers, is a strong indicator of the possibility of fraud or error."
    },
    {
      "id": "1180000047",
      "text": "If the auditor believes an indicated fraud or error could have a material effect on the financial statements, the nature, timing and extent of the procedures to be performed depends on the auditors judgment as to",
      "choices": [
        {
          "id": "c1",
          "text": "The type of fraud or error"
        },
        {
          "id": "c2",
          "text": "The likelihood that a particular type of fraud or error could have a material effect on the financial statements"
        },
        {
          "id": "c3",
          "text": "The likelihood of their occurrence"
        },
        {
          "id": "c4",
          "text": "All of the above"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The auditor should perform procedures that are appropriate to the nature, timing, and extent of the fraud or error."
    },
    {
      "id": "1180000048",
      "text": "If an auditor believes a client may have committed illegal acts, which of the following actions should the auditor take?",
      "choices": [
        {
          "id": "c1",
          "text": "Consult with the clients counsel and the auditors counsel to determine how the suspected illegal acts will be communicated to stockholders"
        },
        {
          "id": "c2",
          "text": "Extend auditing procedures to determine whether the suspected illegal acts have a material effect on the financial statements"
        },
        {
          "id": "c3",
          "text": "Make inquiries of the clients management and obtain an understanding of the circumstances underlying the acts and of other evidence to determine the effects of the acts on the financial statements"
        },
        {
          "id": "c4",
          "text": "Notify each member of the audit committee of the board of directors about the nature of the acts and request that they advise an approach to be taken by the auditor"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The auditor should notify the audit committee about the suspected illegal acts and request their advice."
    },
    {
      "id": "1180000049",
      "text": "When the auditor becomes aware of information concerning a possible noncompliance to laws or regulations, the auditor should appropriately",
      "choices": [
        {
          "id": "c1",
          "text": "Obtain an understanding of the nature of the act and the circumstances in which it has occurred, and evaluate the possible effect on the financial statements"
        },
        {
          "id": "c2",
          "text": "Discuss his suspicion with the management"
        },
        {
          "id": "c3",
          "text": "Ask management to determine whether a violation is really committed"
        },
        {
          "id": "c4",
          "text": "Consult with the entitys legal counsel as to what appropriate action the auditor should do"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The auditor should obtain an understanding of the nature of the act and the circumstances in which it has occurred, and evaluate the possible effect on the financial statements."
    },
    {
      "id": "1180000050",
      "text": "Which of the following circumstances regarding the entitys noncompliance to laws or regulations may cause the auditor to resign from an engagement?",
      "choices": [
        {
          "id": "c1",
          "text": "The auditor is unable to determine whether noncompliance has occurred"
        },
        {
          "id": "c2",
          "text": "If the auditor concludes that the noncompliance has a material effect on the financial statements and has not been properly reflected in the financial statements"
        },
        {
          "id": "c3",
          "text": "When the entity does not take remedial action that he considers necessary in the circumstances even when the noncompliance is not material to financial statements"
        },
        {
          "id": "c4",
          "text": "When the disclosure of the effect of noncompliance to legal authority is necessary"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "The auditor should resign from the engagement if the noncompliance has a material effect on the financial statements and has not been properly reflected in the financial statements."
    },
    {
      "id": "1180000051",
      "text": "An advantage of statistical over non-statistical sampling is that statistical sampling",
      "choices": [
        {
          "id": "c1",
          "text": "Enables auditors to objectively measure the reliability of their sample results"
        },
        {
          "id": "c2",
          "text": "Permits use of a smaller sample size than would be necessary with non-statistical sampling"
        },
        {
          "id": "c3",
          "text": "Is compatible with a wider variety of sample selection methods than is non-statistical sampling"
        },
        {
          "id": "c4",
          "text": "Allows auditors to inject their subjective judgment in determining sample size and selection process in order to audit items of greatest value and highest risk"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Statistical sampling provides objective measures of sampling risk and reliability."
    },
    {
      "id": "1180000052",
      "text": "Of the following statements, which one best differentiates statistical sampling from nonstatistical sampling?",
      "choices": [
        {
          "id": "c1",
          "text": "Statistical sampling is a mathematical approach to inference, whereas nonstatistical sampling is a more subjective approach"
        },
        {
          "id": "c2",
          "text": "Nonstatistical sampling has greater applicability to large populations than does statistical sampling"
        },
        {
          "id": "c3",
          "text": "Nonstatistical sampling is more subjective but produces greater consistency in the application of audit judgment"
        },
        {
          "id": "c4",
          "text": "Nonstatistical sampling has greater applicability to populations that lend themselves to random selection"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Statistical sampling uses mathematical techniques while nonstatistical sampling relies more on auditor judgment."
    },
    {
      "id": "1180000053",
      "text": "Which of the following sampling methods is most useful to auditors when testing for internal control effectiveness?",
      "choices": [
        {
          "id": "c1",
          "text": "Stratified random sampling"
        },
        {
          "id": "c2",
          "text": "Attribute sampling"
        },
        {
          "id": "c3",
          "text": "Variables sampling"
        },
        {
          "id": "c4",
          "text": "Unrestricted random sampling with replacement"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Attribute sampling is most appropriate for testing internal controls as it focuses on the rate of deviations."
    },
    {
      "id": "1180000054",
      "text": "If certain forms are not consecutively numbered",
      "choices": [
        {
          "id": "c1",
          "text": "Selection of a random sample probably is not possible"
        },
        {
          "id": "c2",
          "text": "Systematic sampling may be appropriate"
        },
        {
          "id": "c3",
          "text": "Stratified sampling should be used"
        },
        {
          "id": "c4",
          "text": "Random number tables cannot be used"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Systematic sampling can be used even when items are not consecutively numbered."
    },
    {
      "id": "1180000055",
      "text": "What is the primary objective of using stratification as a sampling method in auditing?",
      "choices": [
        {
          "id": "c1",
          "text": "To increase the confidence level at which a decision will be reached from the results of the sample selected"
        },
        {
          "id": "c2",
          "text": "To determine the occurrence rate for a given characteristic in the population being studied"
        },
        {
          "id": "c3",
          "text": "To decrease the effect of variance in the total population"
        },
        {
          "id": "c4",
          "text": "To determine the precision range of the sample selected"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Stratification reduces the effect of variance by grouping similar items together."
    },
    {
      "id": "1180000056",
      "text": "In comparison with classical variables sampling, which of the following is an advantage of value weighted sampling?",
      "choices": [
        {
          "id": "c1",
          "text": "Value weighted sampling automatically results in a stratified sample"
        },
        {
          "id": "c2",
          "text": "Value weighted sampling results in a smaller sample size if many differences are expected between audited and recorded amounts"
        },
        {
          "id": "c3",
          "text": "Value weighted sampling is particularly appropriate when understatement errors are expected"
        },
        {
          "id": "c4",
          "text": "Value weighted sampling is less likely to overstate the allowance for sampling risk when errors are found in the sample"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Value weighted sampling naturally stratifies the sample based on item values."
    },
    {
      "id": "1180000057",
      "text": "Which of the following best illustrates the concept of sampling risk?",
      "choices": [
        {
          "id": "c1",
          "text": "A randomly chosen sample may not be representative of the population as a whole on the characteristics of interest"
        },
        {
          "id": "c2",
          "text": "An auditor may select audit procedure that are not appropriate to achieve the specific objective"
        },
        {
          "id": "c3",
          "text": "An auditor may fail to recognize errors in the documents examined for chosen sample"
        },
        {
          "id": "c4",
          "text": "The documents related to the chosen sample may not be available for inspection"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Sampling risk occurs when the sample is not representative of the population."
    },
    {
      "id": "1180000058",
      "text": "One of the ways to reduce sampling risk is to",
      "choices": [
        {
          "id": "c1",
          "text": "Use an appropriate method of selecting sample items from the population"
        },
        {
          "id": "c2",
          "text": "Carefully design the audit procedures to be used"
        },
        {
          "id": "c3",
          "text": "Provide proper supervision and instruction of the audit team"
        },
        {
          "id": "c4",
          "text": "Use variables sampling rather than attribute sampling"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Using appropriate sampling methods helps reduce sampling risk."
    },
    {
      "id": "1180000059",
      "text": "One of the causes of non-sampling error is",
      "choices": [
        {
          "id": "c1",
          "text": "Failure to draw a random sample"
        },
        {
          "id": "c2",
          "text": "Failure to draw a representative sample"
        },
        {
          "id": "c3",
          "text": "The use of inappropriate or ineffective audit procedures"
        },
        {
          "id": "c4",
          "text": "The use of attributes sampling instead of variables sampling"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Non-sampling errors occur due to inappropriate audit procedures rather than sampling issues."
    },
    {
      "id": "1180000060",
      "text": "In performing substantive tests, the auditor is concerned with two risks of errors of sampling the alpha error and the beta error",
      "choices": [
        {
          "id": "c1",
          "text": "The alpha error is of greater concern to the auditor than the beta error"
        },
        {
          "id": "c2",
          "text": "The beta error is of greater concern to the auditor than the alpha error"
        },
        {
          "id": "c3",
          "text": "The beta error and the alpha error are of equal importance to the auditor"
        },
        {
          "id": "c4",
          "text": "Neither the alpha error nor the beta error need be considered by the auditor"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Beta error (Type II error) is more concerning as it represents the risk of incorrect acceptance."
    },
    {
      "id": "1180000061",
      "text": "As a result of tests of controls, an auditor assessed control risk too low and decreased substantive testing. This assessment occurred because the true deviation rate in the population was",
      "choices": [
        {
          "id": "c1",
          "text": "Less than the risk of assessing control risk too low, based on the auditors sample"
        },
        {
          "id": "c2",
          "text": "Less than the deviation rate in the auditors sample"
        },
        {
          "id": "c3",
          "text": "More than the risk of assessing control risk too low, based on the auditors sample"
        },
        {
          "id": "c4",
          "text": "More than the deviation rate in the auditors sample"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The true deviation rate was higher than what was found in the sample, leading to an incorrect assessment."
    },
    {
      "id": "1180000062",
      "text": "The likelihood of assessing control risk too high is the risk that the sample selected to test controls",
      "choices": [
        {
          "id": "c1",
          "text": "Does not support the auditors planned assessed level of control risk when the true operating effectiveness of internal control justifies such an assessment"
        },
        {
          "id": "c2",
          "text": "Contains misstatements that could be material to the financial statements when aggregated with misstatements in other account balances or transactions classes"
        },
        {
          "id": "c3",
          "text": "Contains proportionately fewer monetary errors or deviations from prescribed internal controls than exist in the balance or class as a whole"
        },
        {
          "id": "c4",
          "text": "Does not support the tolerable error for some or all of managements assertions"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "This describes the risk of assessing control risk too high when controls are actually effective."
    },
    {
      "id": "1180000063",
      "text": "How would increases in tolerable misstatement and assessed level of control risk affect the sample size in a substantive test of details? Tolerable misstatement Assessed level of control risk",
      "choices": [
        {
          "id": "c1",
          "text": "Increase Increase"
        },
        {
          "id": "c2",
          "text": "Increase Decrease"
        },
        {
          "id": "c3",
          "text": "Decrease Increase"
        },
        {
          "id": "c4",
          "text": "Decrease Decrease"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Higher tolerable misstatement decreases sample size, while higher control risk increases sample size."
    },
    {
      "id": "1180000064",
      "text": "Which of the following results in a decrease in sample size for attributes? Acceptable sampling risk Tolerable deviation rate Expected population deviation rate",
      "choices": [
        {
          "id": "c1",
          "text": "Increase Decrease Increase"
        },
        {
          "id": "c2",
          "text": "Decrease Increase Decrease"
        },
        {
          "id": "c3",
          "text": "Increase Increase Decrease"
        },
        {
          "id": "c4",
          "text": "Increase Increase Increase"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Higher acceptable risk and tolerable rate increase sample size, while lower expected deviation rate decreases it."
    },
    {
      "id": "1180000065",
      "text": "Which of the following statements is correct concerning statistical sampling in tests of controls?",
      "choices": [
        {
          "id": "c1",
          "text": "The population size has little or no effect on determining sample size except for very small populations"
        },
        {
          "id": "c2",
          "text": "The expected population deviation rate has little or no effect on determining sample size except for very small populations"
        },
        {
          "id": "c3",
          "text": "As the population size doubles, the sample size should also double"
        },
        {
          "id": "c4",
          "text": "For a given tolerable rate, a larger sample size should be selected as the expected population deviation rate decreases"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Population size generally has minimal effect on sample size except for very small populations."
    },
    {
      "id": "1180000066",
      "text": "An auditor who uses statistical sampling for attributes in testing internal controls should increase the assessed level of control risk when the",
      "choices": [
        {
          "id": "c1",
          "text": "Sample occurrence rate is less than the expected occurrence rate used in planning the sample"
        },
        {
          "id": "c2",
          "text": "Tolerable rate less the allowance for sampling risk exceeds the sample occurrence rate"
        },
        {
          "id": "c3",
          "text": "Sample occurrence rate plus the allowance for sampling risk exceeds the tolerable rate"
        },
        {
          "id": "c4",
          "text": "Sample occurrence rate plus the allowance for sampling risk equals the tolerable rate"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "When the upper deviation rate exceeds the tolerable rate, control risk should be increased."
    },
    {
      "id": "1180000067",
      "text": "Subsequent events refer to",
      "choices": [
        {
          "id": "c1",
          "text": "Significant events that occur between the balance sheet date and the date of the auditors report which have been discovered by the auditor during the same period"
        },
        {
          "id": "c2",
          "text": "Significant events that occur between the balance sheet date and the date of the auditors report irrespective of the date they have been discovered by the auditor"
        },
        {
          "id": "c3",
          "text": "Significant events that occur between the balance sheet date and the date the audited financial statements have been released to the client, irrespective of the date of their discovery by the auditor"
        },
        {
          "id": "c4",
          "text": "All significant events that occur after balance sheet date"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Subsequent events are those that occur after the balance sheet date and may affect the financial statements."
    },
    {
      "id": "1180000068",
      "text": "Which of the following statements best describes the date of the financial statements?",
      "choices": [
        {
          "id": "c1",
          "text": "The date on which those with the recognized authority assert that they have prepared the entitys complete set of financial statements, including the related notes, and that they have taken responsibility for them"
        },
        {
          "id": "c2",
          "text": "The date that the auditors report and audited financial statements are made available to third parties"
        },
        {
          "id": "c3",
          "text": "The date of the end of the latest period covered by the financial statements, which is normally the date of the most recent balance sheet in the financial statements subject to audit"
        },
        {
          "id": "c4",
          "text": "The date on which the auditor has obtained sufficient appropriate audit evidence on which to base the opinion on the financial statements"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The date of the financial statements is when the auditor has completed the audit and is ready to issue an opinion."
    },
    {
      "id": "1180000069",
      "text": "When completing the audit, the auditor performs procedures designed to identify subsequent events that may require adjustment of, or disclosure in, the financial statements. Accordingly Those that provide evidence about Those that are indicative of conditions conditions that existed at period end that arose subsequent to period end",
      "choices": [
        {
          "id": "c1",
          "text": "Will require adjustment Will require adjustment"
        },
        {
          "id": "c2",
          "text": "Will require adjustment Will require disclosure"
        },
        {
          "id": "c3",
          "text": "Will require disclosure Will require disclosure"
        },
        {
          "id": "c4",
          "text": "Will require disclosure Will require adjustment"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Subsequent events should be disclosed in the financial statements, not adjusted."
    },
    {
      "id": "1180000070",
      "text": "Which of the following is not among the characteristics of the procedures performed in completing the audit?",
      "choices": [
        {
          "id": "c1",
          "text": "They are optional since they have only an indirect impact on the opinion to be expressed"
        },
        {
          "id": "c2",
          "text": "They involve many subjective judgments by the auditor"
        },
        {
          "id": "c3",
          "text": "They are performed after the balance sheet date"
        },
        {
          "id": "c4",
          "text": "They are usually performed by audit managers or other senior members of the audit team who have extensive audit experience with the client"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The audit procedures are not optional as they are performed to draw conclusions about the financial statements."
    },
    {
      "id": "1180000071",
      "text": "A Type I subsequent event involves subsequent information about a condition that existed at the balance sheet date. Subsequent knowledge of which of the following would cause the entity to adjust its December 31 financial statements?",
      "choices": [
        {
          "id": "c1",
          "text": "Sale of an issue of new stock for P500,000 on January 30"
        },
        {
          "id": "c2",
          "text": "Settlement of a damage lawsuit for a customers inquiry sustained February 15 for P100,000"
        },
        {
          "id": "c3",
          "text": "Settlement of litigation in February for P100,000 that had been estimated at P120,000 in the December 31 financial statements"
        },
        {
          "id": "c4",
          "text": "Storm damage of P1 million to the entitys buildings on March 1"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "This is a Type I subsequent event as it involves a change in the financial statements due to a subsequent event."
    },
    {
      "id": "1180000072",
      "text": "A major customer of an audit client suffers a fire just prior to completion of year-end field work. The auditor believes that his event could have a significant direct effect on the financial statements. The auditor should",
      "choices": [
        {
          "id": "c1",
          "text": "Advise management to disclose the events in notes to the financial statements"
        },
        {
          "id": "c2",
          "text": "Disclose the event in the auditors report"
        },
        {
          "id": "c3",
          "text": "Withhold submission of the auditors report until the extent of the direct effect on the financial statements is known"
        },
        {
          "id": "c4",
          "text": "Advise management to adjust the financial statements"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The auditor should disclose the event in the financial statements as it could affect the financial statements."
    },
    {
      "id": "1180000073",
      "text": "Which of the following subsequent events will be least likely to result in an adjustment to the financial statements?",
      "choices": [
        {
          "id": "c1",
          "text": "Culmination of events affecting the realization of accounts receivable owned as of the balance sheet date"
        },
        {
          "id": "c2",
          "text": "Culmination of events affecting the realization of inventories owned as of the balance sheet date"
        },
        {
          "id": "c3",
          "text": "Material changes in the settlement of liability which were estimated as of the balance sheet date"
        },
        {
          "id": "c4",
          "text": "Material changes in the quoted market prices of listed investment securities since the balance sheet date"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Changes in quoted market prices are not typically reflected in the financial statements unless they are material."
    },
    {
      "id": "1180000074",
      "text": "Which of the following is not a procedure normally performed while completing the audit?",
      "choices": [
        {
          "id": "c1",
          "text": "Obtain a lawyers letter"
        },
        {
          "id": "c2",
          "text": "Obtain a representations letter"
        },
        {
          "id": "c3",
          "text": "Perform an overall review using analytical procedures"
        },
        {
          "id": "c4",
          "text": "Obtain confirmation of capital stockholdings from shareholders"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Obtaining a lawyers letter is not a standard procedure in completing the audit."
    },
    {
      "id": "1180000075",
      "text": "Which of the following auditing procedures is ordinarily performed last?",
      "choices": [
        {
          "id": "c1",
          "text": "Reading of the minutes of the directors meetings"
        },
        {
          "id": "c2",
          "text": "Confirming accounts payable"
        },
        {
          "id": "c3",
          "text": "Obtaining a management representation letter"
        },
        {
          "id": "c4",
          "text": "Testing of the purchasing function"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Testing of the purchasing function is usually performed last as it involves verifying the completeness and accuracy of the purchasing process."
    },
    {
      "id": "1180000076",
      "text": "One reason why the independent auditors perform analytical procedures on the clients operations is to identify",
      "choices": [
        {
          "id": "c1",
          "text": "Weaknesses of a material nature in internal control"
        },
        {
          "id": "c2",
          "text": "Non-compliance with prescribed control procedures"
        },
        {
          "id": "c3",
          "text": "Improper separation of accounting and other financial duties"
        },
        {
          "id": "c4",
          "text": "Unusual transactions"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Analytical procedures help auditors identify unusual transactions that may require further investigation."
    },
    {
      "id": "1180000077",
      "text": "Analytical procedures performed in the overall review stage of an audit suggest that several accounts have unexpected relationships. The results of these procedures most likely indicate that",
      "choices": [
        {
          "id": "c1",
          "text": "The communication with the audit committee should be revised"
        },
        {
          "id": "c2",
          "text": "Irregularities exist among the relevant account balances"
        },
        {
          "id": "c3",
          "text": "Additional substantive tests of details are required"
        },
        {
          "id": "c4",
          "text": "Internal control activities are not operating effectively"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Analytical procedures help identify irregularities in account relationships."
    },
    {
      "id": "1180000078",
      "text": "The auditor notices significant fluctuations in key elements of the companys financial statements. If management is unable to provide an acceptable explanation, the auditor should",
      "choices": [
        {
          "id": "c1",
          "text": "Consider the matter as a scope limitation"
        },
        {
          "id": "c2",
          "text": "Perform additional audit procedures to investigate the matter further"
        },
        {
          "id": "c3",
          "text": "Intensify the examination with the expectation of detecting management fraud"
        },
        {
          "id": "c4",
          "text": "Withdrawal from the engagement"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "When significant fluctuations are observed and management cannot provide an acceptable explanation, the auditor should perform additional audit procedures to investigate further. This is part of the auditor's responsibility to obtain sufficient appropriate audit evidence. The auditor should not immediately assume fraud or withdraw from the engagement without proper investigation."
    },
    {
      "id": "1180000079",
      "text": "When auditing related party transactions, an auditor places primary emphasis on",
      "choices": [
        {
          "id": "c1",
          "text": "Ascertaining the rights and obligations of the related parties"
        },
        {
          "id": "c2",
          "text": "Confirming the existence of the related parties"
        },
        {
          "id": "c3",
          "text": "Ensuring that the recording of the related party transactions is equivalent to an arms -length transaction"
        },
        {
          "id": "c4",
          "text": "Evaluating the disclosure of the relat ed party transactions"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The primary focus in auditing related party transactions is evaluating whether they are properly disclosed in the financial statements. This includes assessing whether the nature of the relationship, the transactions, and their terms are adequately disclosed to enable users to understand their impact on the financial statements."
    },
    {
      "id": "1180000080",
      "text": "Which of the following events most likely indicates the existence of related parties?",
      "choices": [
        {
          "id": "c1",
          "text": "Making a loan without scheduled terms for repayment of the funds"
        },
        {
          "id": "c2",
          "text": "Discussing merger terms with a company that is a major competitor"
        },
        {
          "id": "c3",
          "text": "Selling real est ate at a price that differs significantly from its book value"
        },
        {
          "id": "c4",
          "text": "Borrowing a large sum of money at a variable rate of interest"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Making a loan without scheduled terms for repayment is a strong indicator of a related party transaction because it suggests terms that are not typical of an arm's-length transaction. This type of arrangement often occurs between related parties where formal terms might not be necessary due to the relationship between the parties."
    },
    {
      "id": "1180000081",
      "text": "After determining that a related party transaction has, in fact, occurred, an auditor should",
      "choices": [
        {
          "id": "c1",
          "text": "Obtain an understanding of the busines s purpose of the transactions"
        },
        {
          "id": "c2",
          "text": "Substantiate that the transaction was consummated on terms equivalent to an arms -length transaction"
        },
        {
          "id": "c3",
          "text": "Add a separate paragraph to the auditors report to explain the transaction"
        },
        {
          "id": "c4",
          "text": "Perform analytical procedures to verify whether similar transactions occurred, but were not recorded"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "After identifying a related party transaction, the auditor should first understand its business purpose. This understanding helps assess whether the transaction appears reasonable and whether it has been properly recorded and disclosed in the financial statements."
    },
    {
      "id": "1180000082",
      "text": "The main purpose of management representations is to",
      "choices": [
        {
          "id": "c1",
          "text": "Shift responsibility for financial statements from the auditors to management"
        },
        {
          "id": "c2",
          "text": "Shift responsibility for financial statements from the manageme nt to auditors"
        },
        {
          "id": "c3",
          "text": "Provide a substitute source of audit evidence for substantive procedures that auditors would otherwise perform"
        },
        {
          "id": "c4",
          "text": "Impress on management its ultimate responsibility for the financial statements and disclosures"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Management representations serve to emphasize management's ultimate responsibility for the financial statements and disclosures. While they provide audit evidence, their primary purpose is to ensure management acknowledges its responsibility for the financial statements."
    },
    {
      "id": "1180000083",
      "text": "A purpose of a management represen tation letter is to reduce",
      "choices": [
        {
          "id": "c1",
          "text": "Audit risk to an aggregate level of misstatement that could be considered material"
        },
        {
          "id": "c2",
          "text": "An auditors responsibility to detect material misstatements only to the extent that the letter is relied on"
        },
        {
          "id": "c3",
          "text": "The possibility of misunderstanding c oncerning managements responsibility for the financial statements"
        },
        {
          "id": "c4",
          "text": "The scope of an auditors procedures concerning related party transactions and subsequent events"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The management representation letter helps reduce the possibility of misunderstandings about management's responsibilities for the financial statements. It serves as a formal acknowledgment of management's responsibilities and commitments."
    },
    {
      "id": "1180000084",
      "text": "A representation letter issued by a client",
      "choices": [
        {
          "id": "c1",
          "text": "Is essential for the preparation of the audit pr ogram"
        },
        {
          "id": "c2",
          "text": "Is a substitute for testing"
        },
        {
          "id": "c3",
          "text": "Does not reduce the auditors responsibility"
        },
        {
          "id": "c4",
          "text": "Reduces the auditors responsibility only to the extent that it is relied upon"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "A representation letter does not reduce the auditor's responsibility. It is a form of audit evidence that complements other audit procedures but does not replace them or reduce the auditor's overall responsibility."
    },
    {
      "id": "1180000085",
      "text": "When considering the use of managements written representations as audit evidence about the completeness assertion, the auditor should understand that such representations",
      "choices": [
        {
          "id": "c1",
          "text": "Constitute sufficient appropriate audit evidence to support the assertion when considered in combination with a sufficiently low assessed level of control risk"
        },
        {
          "id": "c2",
          "text": "Are not part of the audit evidence considered to support th e assertion"
        },
        {
          "id": "c3",
          "text": "Replace a low assessed level of control risk as audit evidence to support the assertion"
        },
        {
          "id": "c4",
          "text": "Complement, but do not replace, substantive tests designed to support the assertion"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Management representations complement but do not replace substantive tests. They are one form of audit evidence that should be used in conjunction with other audit procedures to support the completeness assertion."
    },
    {
      "id": "1180000086",
      "text": "Which of the following matters would an auditor most likely include in a management representation letter?",
      "choices": [
        {
          "id": "c1",
          "text": "Communications with the audit committee concerning weaknesses in the internal control structure"
        },
        {
          "id": "c2",
          "text": "The completeness and availability of minutes of stockholders and directors meetings"
        },
        {
          "id": "c3",
          "text": "Plans to acquire or merge with other e ntities in the subsequent year"
        },
        {
          "id": "c4",
          "text": "Managements acknowledgment of its responsibility for the detection of employee fraud"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "The completeness and availability of minutes of stockholders and directors meetings is a matter that should be included in the management representation letter. This is important because these minutes may contain information relevant to the financial statements."
    },
    {
      "id": "1180000087",
      "text": "Which of the following statements best describes the auditors responsibility concerning the appropriateness of the going concern assumption in the preparation of the financial statements?",
      "choices": [
        {
          "id": "c1",
          "text": "The auditors responsibility is to make a specific assessment of the entitys ability to continue as a going concern"
        },
        {
          "id": "c2",
          "text": "The auditors responsibility is to predict future events or conditions that may cause the entity to cease to continue as a going concern"
        },
        {
          "id": "c3",
          "text": "The auditors responsibility is to consider the appropriateness of managements use of the going concern assumption and consider whether there are material uncertainties about the entitys ability to continue as a going concern that need to be disclosed in the financial statements"
        },
        {
          "id": "c4",
          "text": "The auditors responsibility is to give a guarantee in the audit report that the entity has the ability to continue as a going concern"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The auditor's responsibility is to evaluate management's use of the going concern assumption and assess whether there are material uncertainties that need to be disclosed. The auditor does not make predictions about the future or provide guarantees."
    },
    {
      "id": "1180000088",
      "text": "When the auditor concludes that there is substantial doubt about a continuing audit clients ability to continue as a going concern for a reasonable period of time, the auditors responsibility is to",
      "choices": [
        {
          "id": "c1",
          "text": "Consider the adequacy of disclosures about the clients possible inability to continue as a g oing concern"
        },
        {
          "id": "c2",
          "text": "Issue a qualified or adverse opinion, depending upon materiality, due to the possible effects of the financial statements"
        },
        {
          "id": "c3",
          "text": "Report to the clients audit committee that managements accounting estimates may need to be adjusted"
        },
        {
          "id": "c4",
          "text": "Reissue the prior y ears auditors report and add an emphasis of matter paragraph that specifically refers to substantial doubt and going concern"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "When there is substantial doubt about the entity's ability to continue as a going concern, the auditor's primary responsibility is to evaluate whether the financial statements adequately disclose this uncertainty. The auditor should assess whether the disclosures are sufficient to inform users about the situation."
    },
    {
      "id": "1180000089",
      "text": "Which of the following audit procedures would most likely assist an auditor in identifying conditions and events that may indicate there could be substantial doubt about an entitys ability to continue as a going concern?",
      "choices": [
        {
          "id": "c1",
          "text": "Confirmation of bank balances"
        },
        {
          "id": "c2",
          "text": "Confirmation of accounts receivable from major customers"
        },
        {
          "id": "c3",
          "text": "Reconciliation of interest expense with debt outstanding"
        },
        {
          "id": "c4",
          "text": "Review of compliance with terms of debt agreements"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "Reviewing compliance with terms of debt agreements helps identify potential going concern issues by revealing whether the entity is meeting its financial obligations and maintaining required financial ratios or covenants."
    },
    {
      "id": "1180000090",
      "text": "Which of the following auditing procedures most likely would assist an auditor in identifying conditions and events that may indicate substantial doubt about an entitys ability to continue as a going concern?",
      "choices": [
        {
          "id": "c1",
          "text": "Inspecting title documents to verify whether any assets are pledged as collateral"
        },
        {
          "id": "c2",
          "text": "Confirming with third parties the details of arrangements to maintain financial support"
        },
        {
          "id": "c3",
          "text": "Reconciling the cash balance per books with the cut -off bank statement and the bank con firmation"
        },
        {
          "id": "c4",
          "text": "Comparing the entitys depreciation and asset capitalization policies to other entities in the industry"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Confirming with third parties about financial support arrangements helps assess whether the entity has access to necessary funding to continue operations, which is crucial for evaluating going concern status."
    },
    {
      "id": "1180000091",
      "text": "Which of the following conditions or events most likely would cause an auditor to have substantial doubt about an entitys ability to continu e as a going concern?",
      "choices": [
        {
          "id": "c1",
          "text": "Cash flows from operating activities are negative"
        },
        {
          "id": "c2",
          "text": "Stock dividends replace annual cash dividends"
        },
        {
          "id": "c3",
          "text": "Significant related party transactions are pervasive"
        },
        {
          "id": "c4",
          "text": "Research and development projects are postponed"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Negative cash flows from operating activities are a significant indicator of potential going concern issues as they suggest the entity may not be able to generate sufficient cash to meet its obligations."
    },
    {
      "id": "1180000092",
      "text": "Which of the following conditions or events most likely would cause an auditor to have substantial doubt about an entitys ability to continue as a going concern?",
      "choices": [
        {
          "id": "c1",
          "text": "Restrictions on the disposal of principal assets are present"
        },
        {
          "id": "c2",
          "text": "Usual trade credit from suppliers is denied"
        },
        {
          "id": "c3",
          "text": "Significant related party transactions are pervasive"
        },
        {
          "id": "c4",
          "text": "Arrearages in principal stock dividends are paid"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "Denial of usual trade credit from suppliers is a significant indicator of going concern issues as it suggests that suppliers have lost confidence in the entity's ability to meet its obligations."
    },
    {
      "id": "1180000093",
      "text": "An auditor believes that there is substantial doubt about an entitys ability to continue as a going concern for a reasonable period of time. In evaluating the enti tys plans for dealing with the adverse effects of future conditions and events, the auditor most likely would consider, as a mitigating factor, the entitys plans to",
      "choices": [
        {
          "id": "c1",
          "text": "Repurchase the entitys stock at a price below its book value"
        },
        {
          "id": "c2",
          "text": "Issue stock options to key executives"
        },
        {
          "id": "c3",
          "text": "Lease rather than purchase operating facilities"
        },
        {
          "id": "c4",
          "text": "Accelerate the due date of an existing mortgage"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Leasing rather than purchasing operating facilities can be a mitigating factor as it reduces the need for large capital expenditures and provides more flexibility in managing cash flows."
    },
    {
      "id": "1180000094",
      "text": "X, CPA, believes that there is substantial doubt about the ability of a company to continue as a going concern for a reasonable period of time. In evaluating the companys plans for dealing with the adverse effects of future conditions and events, X most likely would consider, as a mitigating factor, the companys plans to",
      "choices": [
        {
          "id": "c1",
          "text": "Discuss with lenders the terms of all debt and loan agreements"
        },
        {
          "id": "c2",
          "text": "Strengthen internal controls over cash disburs ements"
        },
        {
          "id": "c3",
          "text": "Purchase production facilities currently being leased from a related party"
        },
        {
          "id": "c4",
          "text": "Postpone expenditures for research and development projects"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Discussing with lenders about debt and loan agreements can be a mitigating factor as it may lead to more favorable terms or additional financing that could help the entity continue operations."
    },
    {
      "id": "1180000095",
      "text": "The adverse effects of events causing an auditor to believe there is substantial doubt about an entitys ability to continue as a going concern would most likely be mitigated by evidence relating to the",
      "choices": [
        {
          "id": "c1",
          "text": "Ability to expand operations into new product lines in the future"
        },
        {
          "id": "c2",
          "text": "Feasibility of plans to purchase leased equipment at less than market value"
        },
        {
          "id": "c3",
          "text": "Marketability of assets that management plans to sell"
        },
        {
          "id": "c4",
          "text": "Committed arrangements to convert preferred stock to long -term debt"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The marketability of assets that management plans to sell is a crucial mitigating factor as it indicates the entity's ability to generate cash through asset sales if needed."
    },
    {
      "id": "1180000096",
      "text": "Which of the following procedures would an auditor most likely perform to obtain evidence about the occurrence of subsequent events?",
      "choices": [
        {
          "id": "c1",
          "text": "Recomputing a sample of large -peso transactions occurring after year -end for arithmetic accuracy"
        },
        {
          "id": "c2",
          "text": "Investigating changes in stockholders equity occurring after year -end"
        },
        {
          "id": "c3",
          "text": "Inquiring of the entitys legal counsel concerning litigation, claims and assessment arising after yea r- end"
        },
        {
          "id": "c4",
          "text": "Confirming bank accounts established after year -end"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "Inquiring of legal counsel about post-year-end litigation and claims is a key procedure for identifying subsequent events that may require adjustment or disclosure in the financial statements."
    },
    {
      "id": "1180000097",
      "text": "The primary reason an auditor requests that letters of inquiry be sent to a clients attorneys is to provide the auditor with",
      "choices": [
        {
          "id": "c1",
          "text": "A description and evaluation of litigation, claims and assessments that existed at the balance sheet date"
        },
        {
          "id": "c2",
          "text": "The attorneys opinions of the clients historical experiences in recent similar litigation"
        },
        {
          "id": "c3",
          "text": "Corroboration of the information furnished by management about litigation, claims and assessments"
        },
        {
          "id": "c4",
          "text": "The probable outcome of asserte d claims and pending or threatened litigation"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The primary purpose of the letter of inquiry is to obtain information about litigation, claims, and assessments that existed at the balance sheet date, which is essential for proper financial statement presentation."
    },
    {
      "id": "1180000098",
      "text": "The letter of audit inquiry should be",
      "choices": [
        {
          "id": "c1",
          "text": "Prepared and sent by the auditor"
        },
        {
          "id": "c2",
          "text": "Prepared by management and sent by the auditor"
        },
        {
          "id": "c3",
          "text": "Prepared and sent by management"
        },
        {
          "id": "c4",
          "text": "Prepared by the auditor and sent by management"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The letter of audit inquiry should be prepared by the auditor but sent by management to maintain the attorney-client privilege and ensure proper communication."
    },
    {
      "id": "1180000099",
      "text": "Auditors often request that the audit client send a letter of inquiry to those attorneys who have been consulted with respect to litigation, claims, or assessments. The primary reason for this request is to provide the auditors with",
      "choices": [
        {
          "id": "c1",
          "text": "An estimate of the doll ar amount of the probable loss"
        },
        {
          "id": "c2",
          "text": "An expert opinion as to whether a loss is possible, probable or remote"
        },
        {
          "id": "c3",
          "text": "Information concerning the progress of cases to date"
        },
        {
          "id": "c4",
          "text": "Corroborative audit evidence"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The primary purpose of the letter of inquiry is to obtain corroborative audit evidence about litigation, claims, and assessments from an independent source."
    },
    {
      "id": "1180000100",
      "text": "The refusal of a clients lawyer to provide a representation on the leg ality of a particular act committed by the client is ordinarily",
      "choices": [
        {
          "id": "c1",
          "text": "Proper grounds to withdraw from the engagement"
        },
        {
          "id": "c2",
          "text": "Insufficient reason to modify the auditors report because of the lawyers obligation of confidentiality"
        },
        {
          "id": "c3",
          "text": "Considered to be a scope limitation"
        },
        {
          "id": "c4",
          "text": "Sufficient reason to issue a subject to opinion"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "A lawyer's refusal to provide representations is considered a scope limitation because it prevents the auditor from obtaining necessary audit evidence about potential legal issues."
    },
    {
      "id": "1180000101",
      "text": "After issuing a report, an auditor has no obligation to make continuing inquiries or perform other procedures concerning the audited financial statements, unless",
      "choices": [
        {
          "id": "c1",
          "text": "Information, which existed at the report date a nd may affect the report, comes to the auditors attention"
        },
        {
          "id": "c2",
          "text": "Management of the entity requests the auditor to reissue the auditors report"
        },
        {
          "id": "c3",
          "text": "Information about an event that occurred after the date of the auditors report comes to the auditors attention"
        },
        {
          "id": "c4",
          "text": "Final determinations or resolutions are made of contingencies that had been disclosed in the financial statements"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "The auditor has a continuing responsibility to investigate if information that existed at the report date and may affect the report comes to their attention after the report is issued."
    },
    {
      "id": "1180000102",
      "text": "An auditor concludes that a substantive auditing procedure considered necessary during the prior periods audit was omitted. Which of the following factors would most likely cause the auditor promptly to apply the omitted procedure?",
      "choices": [
        {
          "id": "c1",
          "text": "Which of the following factors would most likely cause the auditor promptly to apply the omitted procedure?"
        },
        {
          "id": "c2",
          "text": "There are no alternative procedures available to provide the same evidence as the omitted procedure"
        },
        {
          "id": "c3",
          "text": "The omission of the procedure impairs the auditors present a bility to support the previously expressed opinion"
        },
        {
          "id": "c4",
          "text": "The source documents needed to perform the omitted procedure are still available"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "If the omitted procedure impairs the auditor's ability to support the previously expressed opinion, the auditor should promptly apply the procedure to maintain the integrity of the audit opinion."
    },
    {
      "id": "1180000103",
      "text": "An auditor is considering whether the omis sion of a substantive procedure considered necessary at the time of an audit may impair the auditors present ability to support the previously expressed opinion. The auditor need not apply the omitted procedure if the",
      "choices": [
        {
          "id": "c1",
          "text": "Financial statements and auditors re port were not distributed beyond management and the board of directors"
        },
        {
          "id": "c2",
          "text": "Auditors previously expressed opinion was qualified because of a departure from GAAP"
        },
        {
          "id": "c3",
          "text": "Results of other procedures that were applied tend to compensate for the procedure omitted"
        },
        {
          "id": "c4",
          "text": "Omission is due to unreasonable delays by client personnel in providing data on a timely basis"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "If other procedures provide sufficient evidence to support the opinion, the auditor need not apply the omitted procedure as the audit objectives have been met through alternative means."
    },
    {
      "id": "1180000104",
      "text": "Which of the following statements is not correct about the unmodified audit report on the financial statements?",
      "choices": [
        {
          "id": "c1",
          "text": "The auditors report shall include a se ction with a heading Managements Responsibility for the financial statements"
        },
        {
          "id": "c2",
          "text": "The auditors report shall include a section with a heading Auditors Responsibility"
        },
        {
          "id": "c3",
          "text": "The auditors report shall include a section with a heading Introduction"
        },
        {
          "id": "c4",
          "text": "The auditors report shall include a section with a heading Opinion"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The unmodified audit report does not include a section with a heading \"Introduction.\" The standard report includes sections for Management's Responsibility, Auditor's Responsibility, and Opinion."
    },
    {
      "id": "1180000105",
      "text": "The Opinion paragraph in the auditors report would normally include the following, except",
      "choices": [
        {
          "id": "c1",
          "text": "Identification of the financial statements audited"
        },
        {
          "id": "c2",
          "text": "Should refer to the summary of significant policies and o ther explanatory notes"
        },
        {
          "id": "c3",
          "text": "Date and period covered by the financial statements"
        },
        {
          "id": "c4",
          "text": "A description of the work to be performed by the auditor"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The Opinion paragraph should not include a description of the work to be performed by the auditor. This would be inappropriate as the work has already been performed when the opinion is issued."
    },
    {
      "id": "1180000106",
      "text": "How are managements responsibility and the auditors responsibility represented in the auditors report? Management Responsibility Auditors Responsibility",
      "choices": [
        {
          "id": "c1",
          "text": "Explicitly Explicitly"
        },
        {
          "id": "c2",
          "text": "Implicitly Implicitly"
        },
        {
          "id": "c3",
          "text": "Implicitly Explicitly"
        },
        {
          "id": "c4",
          "text": "Explicitly Implicitly"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "Both management's responsibility and the auditor's responsibility are explicitly stated in the auditor's report to ensure clear communication of each party's role."
    },
    {
      "id": "1180000107",
      "text": "PSA 700 requires the auditors report to describe managements responsibility for the financial statements. The description shall include an explanation that management is responsible for the preparation of the financial statements and",
      "choices": [
        {
          "id": "c1",
          "text": "For selecting and applying appropriate accounting policies"
        },
        {
          "id": "c2",
          "text": "For such internal control as it determines necessary to enable the preparation of financial statements that are free from material misstatement"
        },
        {
          "id": "c3",
          "text": "For making accounting estimates that are reasonable in the circumstances"
        },
        {
          "id": "c4",
          "text": "Preventing collusion among employees"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "PSA 700 requires that management's responsibility includes establishing and maintaining internal control necessary to enable the preparation of financial statements free from material misstatement."
    },
    {
      "id": "1180000108",
      "text": "The Auditors Responsibility paragraph in the auditors report would normally include the following, except",
      "choices": [
        {
          "id": "c1",
          "text": "Statement that the audit was conducted in accordance with PSAs"
        },
        {
          "id": "c2",
          "text": "Statement that the audit was planned and performed to obtain reasonable assurance about whether the financial statements are free of material misstatement"
        },
        {
          "id": "c3",
          "text": "Statement by the auditor that the audit provides a basis for the opinion"
        },
        {
          "id": "c4",
          "text": "Statement that the audit includes examining on a detailed basis evidence supporting the amounts and disclosures in t he financial statements"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The Auditor's Responsibility paragraph should not include a statement about examining evidence on a detailed basis, as this would be too specific and could create unrealistic expectations about the nature of audit procedures."
    },
    {
      "id": "1180000109",
      "text": "An auditor should disclose the substantive reasons for expressing an opinion in a separate paragraph",
      "choices": [
        {
          "id": "c1",
          "text": "Preceding the managements responsibility for the financial statements"
        },
        {
          "id": "c2",
          "text": "Preceding the opinion paragraph"
        },
        {
          "id": "c3",
          "text": "Following the opinion paragraph"
        },
        {
          "id": "c4",
          "text": "Within the notes to the financi al statements"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "The substantive reasons for expressing an opinion should be disclosed in a separate paragraph preceding the opinion paragraph to provide context for the opinion that follows."
    },
    {
      "id": "1180000110",
      "text": "The O ther Matter paragraph is used by the auditor",
      "choices": [
        {
          "id": "c1",
          "text": "To draw the readers attention to a matter presented in the financial statements"
        },
        {
          "id": "c2",
          "text": "To draw the readers attention to a matter disclosed in the notes to the financial statements"
        },
        {
          "id": "c3",
          "text": "To draw the readers attention to a matter not presented or disclosed in the financial statements"
        },
        {
          "id": "c4",
          "text": "To draw the readers attention to a matter that gives rise to a modification of an opinion"
        }
      ],
      "correctAnswerId": "c3",
      "explanation": "The Other Matter paragraph is used to draw attention to matters that are not presented or disclosed in the financial statements but are relevant to users' understanding of the audit, the auditor's responsibilities, or the auditor's report."
    },
    {
      "id": "1180000111",
      "text": "When financial statements contain material misstatements, the auditors report may contain Qualified Opinion Adverse Opinion Disclaimer of Opinion",
      "choices": [
        {
          "id": "c1",
          "text": "Yes No Yes"
        },
        {
          "id": "c2",
          "text": "Yes Yes No"
        },
        {
          "id": "c3",
          "text": "No No Yes"
        },
        {
          "id": "c4",
          "text": "Yes Yes Yes"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "When financial statements contain material misstatements, the auditor may issue a qualified opinion, an adverse opinion, or a disclaimer of opinion, depending on the nature and pervasiveness of the misstatements."
    },
    {
      "id": "1180000112",
      "text": "When the auditor knows that the financial statements may be misleading because they were not prepared in conformity with financial reporting standards, he or she must issue",
      "choices": [
        {
          "id": "c1",
          "text": "A qualified opinion"
        },
        {
          "id": "c2",
          "text": "An adverse opinion"
        },
        {
          "id": "c3",
          "text": "A disclaimer of opinion"
        },
        {
          "id": "c4",
          "text": "A qualified or an adverse opinion, depending on the materiality and pervasiveness"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "The auditor must issue either a qualified or adverse opinion when financial statements are not prepared in conformity with financial reporting standards, with the choice depending on whether the effects are material but not pervasive (qualified) or material and pervasive (adverse)."
    },
    {
      "id": "1180000113",
      "text": "Auditors found that the entity has not capitalized a material amount of leases in the financial statements. When considering the materiality of this departure from financial reporting standards, the auditors would choose between which reporting options?",
      "choices": [
        {
          "id": "c1",
          "text": "Unqualified opinion or disclaimer of opinion"
        },
        {
          "id": "c2",
          "text": "Unqualified opinion or qualified opinion"
        },
        {
          "id": "c3",
          "text": "Emphasis paragraph with unqualified opinion or an adverse opinion"
        },
        {
          "id": "c4",
          "text": "Qualified opinion or adverse opinion"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "When there is a material departure from financial reporting standards, the auditor must choose between a qualified opinion (if the effects are material but not pervasive) or an adverse opinion (if the effects are material and pervasive)."
    },
    {
      "id": "1180000114",
      "text": "An auditor would issue an adverse opinion if",
      "choices": [
        {
          "id": "c1",
          "text": "The audit was begun by other independent auditors who withdrew from the engagement"
        },
        {
          "id": "c2",
          "text": "A qualified opinion cannot be given because the auditor lacks independence"
        },
        {
          "id": "c3",
          "text": "The restriction on the scope of the audit was significant"
        },
        {
          "id": "c4",
          "text": "The statements taken as a whole do not fairly present the financial condition and results of operations of the company"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "An adverse opinion is issued when the auditor concludes that the financial statements taken as a whole do not fairly present the financial condition and results of operations, typically due to material and pervasive misstatements."
    },
    {
      "id": "1180000115",
      "text": "When the auditor is unable to obtain sufficient appropriate audit evidence because of client -imposed limitation, the auditors report may contain Qualified Opinion Adverse Opinion Disclaimer of Opinion",
      "choices": [
        {
          "id": "c1",
          "text": "Yes No Yes"
        },
        {
          "id": "c2",
          "text": "Yes Yes No"
        },
        {
          "id": "c3",
          "text": "No No Yes"
        },
        {
          "id": "c4",
          "text": "Yes Yes Yes"
        }
      ],
      "correctAnswerId": "c4",
      "explanation": "When there is a client-imposed limitation, the auditor may issue a qualified opinion, adverse opinion, or disclaimer of opinion, depending on the nature and pervasiveness of the limitation and its effects on the financial statements."
    },
    {
      "id": "1180000116",
      "text": "Restrictions imposed by a client prohibit the observation of physical inventories, which account for 35 of all assets. Alternative audit procedures cannot be applied, although the auditor was able to examine satisfactory evidence for all other items in the financial statements. The auditor should issue aan",
      "choices": [
        {
          "id": "c1",
          "text": "Except for qualified opinion"
        },
        {
          "id": "c2",
          "text": "Disclaimer of opinion"
        },
        {
          "id": "c3",
          "text": "Unqualified opinion with a separate explanatory paragraph"
        },
        {
          "id": "c4",
          "text": "Unqualified opinion with an explanation in the scope paragraph"
        }
      ],
      "correctAnswerId": "c1",
      "explanation": "When the auditor cannot observe physical inventory and alternative procedures are not possible, a qualified opinion is appropriate as the scope limitation affects a specific aspect of the financial statements but is not pervasive."
    },
    {
      "id": "1180000117",
      "text": "A limitation on the scope of the audit sufficient to preclude an unqualified opinion will always result when management",
      "choices": [
        {
          "id": "c1",
          "text": "Asks the auditor to report on the balance sheet and not on the other basic financial statements"
        },
        {
          "id": "c2",
          "text": "Refuses to permit its lawyer to respond to the letter of audit inquiry"
        },
        {
          "id": "c3",
          "text": "Discloses material related party transactions in the notes to the financial statements"
        },
        {
          "id": "c4",
          "text": "Knows that confirmation of ac counts receivable is not feasible"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "A refusal to allow the lawyer to respond to the letter of audit inquiry constitutes a scope limitation that precludes an unqualified opinion, as it prevents the auditor from obtaining necessary evidence about litigation and claims."
    },
    {
      "id": "1180000118",
      "text": "When the auditor concludes that the use of the going concern assumption is appropriate in the circumstances, but material uncertainty exists, the auditor should",
      "choices": [
        {
          "id": "c1",
          "text": "Issue either qualified or adverse opinion"
        },
        {
          "id": "c2",
          "text": "Consider the adequacy of disclosure in the notes to financial statements"
        },
        {
          "id": "c3",
          "text": "Report to the audit committee the need to adjust management estimates"
        },
        {
          "id": "c4",
          "text": "Reissue the prior years audit report and add an emphasis of a matter paragraph"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "When there is a material uncertainty about going concern, the auditor should first consider whether the uncertainty is adequately disclosed in the notes to the financial statements."
    },
    {
      "id": "1180000119",
      "text": "When an auditor of financial statements has substantial doubt about an entitys ability to continue as a going concern because of the probable discontinuance of operations, the auditor most likely would express a qualified opinion if",
      "choices": [
        {
          "id": "c1",
          "text": "The effects of the adverse financial conditions l ikely will cause a bankruptcy filing"
        },
        {
          "id": "c2",
          "text": "Information about the entitys ability to continue as a going concern is not disclosed"
        },
        {
          "id": "c3",
          "text": "Management has no plans to reduce or delay future expenditures"
        },
        {
          "id": "c4",
          "text": "Negative trends and recurring operating losses appear to be irreversible"
        }
      ],
      "correctAnswerId": "c2",
      "explanation": "If the entity's ability to continue as a going concern is not adequately disclosed in the financial statements, the auditor should express a qualified opinion due to the inadequate disclosure."
    }
  ]